"use strict";

/* -------------------- */
/* ==== Цикл while ==== */
/* -------------------- */

/*
var i = 0;
while (i <= 3) {
    alert(i);
    i++;
}
*/

/*var i = 3;
while (i) {
    alert(i);
    i--;
}*/

/* ------------------------ */
/* ==== Цикл do…while ==== */
/* ------------------------ */

/*
do {
    // тело цикла
} while (условие);
*/
/*
var i = 3;
do {
    alert(i);
    i++;
} while (i <= 3);

do {
    alert(i);
    i--;
} while (i);
*/

/* ------------------ */
/* ==== Цикл for ==== */
/* ------------------ */

/*
for (начало; условие; шаг) {
    // ... тело цикла ...
}

for (i; i <= 3; i++) {
    alert(i);
}

 alert('i равна = ' + i);

*/

/*
for (var i = 3; i; i--) {
    alert(i);
}
*/

/* --------------------------------- */
/* ==== Прерывание цикла: break ==== */
/* --------------------------------- */

/*
var sum = 0;

while (true) {
    var value = +prompt('Введите число', '');
    if (!value) break; // (*)

    sum += value;

}

alert('Сумма: ' + sum);
*/


/* -------------------------------------- */
/* ==== Следующая итерация: continue ==== */
/* -------------------------------------- */

/*
for (var i = 0; i < 10; i++) {

    if (i % 2 == 0) continue;

    alert(i);
}

for (var i = 0; i < 10; i++) {

    if (i % 2) {
        alert( i );
    }

}
*/

/* -------------------------------------- */
/* ==== Метки для break/continue ==== */
/* -------------------------------------- */

/*
outer:
    for (var i = 0; i < 3; i++) {

        for (var j = 0; j < 3; j++) {

            var input = prompt('Значение в координатах ' + i + ',' + j, '');

            // если отмена ввода или пустая строка -
            // завершить оба цикла
            if (!input) break outer; // (*)

        }
    }
alert('Готово!');
*/

/* -------------------------------------- */
/* ==== Task ==== */
/* -------------------------------------- */

/*
var i = 3;

while (i) {
    alert( i-- );
}


var i = 0;
while (++i < 5) alert( i );

var i = 0;
while (i++ < 5) alert( i );


for (var i = 0; i < 5; i++) alert( i );

for (var i = 0; i < 5; ++i) alert( i );


for (var i = 1; i <= 10; i++) {

    if (i % 2 == 1) continue;

    alert(i);
}

for (var i = 2; i <= 10; i++) {

    if (i % 2 == 0) {
        alert(i);
    }
}

*/
/*

for (let i = 0; i < 3; i++) {
    alert( "номер " + i + "!" );
}
// Показывает 0,1,2

var i = 0;
while (i < 3) {
    alert( "номер " + i + "!" );
    i++;
}
//Показывает 0,1,2

var u = 0;
do {
    alert( u + "!" );
    u++;
} while (u < 3);
//Показывает 0,1,2
*/
/*
var name = prompt("Ваше имя?", "");
alert( name );
*/

for (;;) {
    var i = prompt('Введите число: ', '');

    if (i >= 100 && i != null) break;
}

alert('В ввели число больше 100 - это ' + i + ' вы угадали!');
